src/Documents/ПокупкаЦБ/ПокупкаЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПокупкаЦБ</name>
  <registerRecords>AccumulationRegister.ПортфельЦБ</registerRecords>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦБ</name>
    <type>
      <types>CatalogRef.Облигации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПортфельЦБ/ПортфельЦБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПортфельЦБ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦБ</name>
    <type>
      <types>CatalogRef.Облигации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПокупкаЦБ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	Движения.ПортфельЦБ.Записывать = Истина;
	Для Каждого ТекСтрокаСписок из Список Цикл
		Движение = Движения.ПортфельЦБ.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Портфель = Портфель;
		Движение.ЦБ = ЦБ;
		Движение.Количество = ТекСтрокаСписок.Количество;
	КонецЦикла;
КонецПроцедуры
